Autodesk.Revit.DB.FloorType.StructuralMaterialId
Returns the identifier of the material that defines the element's structural analysis properties.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: the floor does not have a structural material
Since:
2014